#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.argo_cd.data.azurerm_kubernetes_cluster.credentials will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "credentials" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "aks-polinetwork"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "rg-polinetwork"
      + role_based_access_control_enabled                = (known after apply)
      + service_principal                                = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.argo_cd.azurerm_kubernetes_cluster.k8s will be created
  + resource "azurerm_kubernetes_cluster" "k8s" {
      + api_server_authorized_ip_ranges     = [
          + "185.178.95.235/32",
        ]
      + dns_prefix                          = "aks-polinetwork"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "aks-polinetwork"
      + node_resource_group                 = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-polinetwork"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Development"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "agentpool"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "standard_a2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "ubuntu"

          + ssh_key {
              + key_data = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIETs+7W2exMT/Ekos8bagl/raY0YGiQLK7l7Q9dpBLyL Microsoft AKS SSH Key"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = (known after apply)
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = (known after apply)
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

  # module.argo_cd.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-polinetwork"
    }

  # module.argo_cd.helm_release.argo_cd will be created
  + resource "helm_release" "argo_cd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                configs:
                  repositoriesAnnotations:
                    managed-by: argocd.argoproj.io
                server:
                  ingress:
                    enabled: true
                    https: true
                    className: ingress-polinetwork
            EOT,
        ]
      + verify                     = false
      + version                    = "5.5.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argo_cd.helm_release.argocd_apps will be created
  + resource "helm_release" "argocd_apps" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications: 
                  - name: bot-dev
                    namespace: argocd
                    project: default
                    source:
                      repoURL: https://github.com/poliNetworkOrg/polinetwork-cd
                      targetRevision: HEAD
                      path: dev
                      directory:
                        recurse: true
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: bot
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                    info:
                    - name: url
                      value: https://argoproj.github.io/
            EOT,
        ]
      + verify                     = false
      + version                    = "0.0.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argo_cd.kubernetes_ingress.ingress will be created
  + resource "kubernetes_ingress" "ingress" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class" = "ingress-polinetwork"
            }
          + generation       = (known after apply)
          + name             = "ingress-polinetwork"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "ingress-service"
                          + service_port = "8080"
                        }
                    }
                }
            }
        }
    }

  # module.argo_cd.kubernetes_ingress_class.argocd will be created
  + resource "kubernetes_ingress_class" "argocd" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + controller = "argocd.com/ingress-controller"

          + parameters {
              + api_group = "k8s.argocd.com"
              + kind      = "IngressParameters"
              + name      = "external-lb"
              + scope     = (known after apply)
            }
        }
    }

  # module.argo_cd.kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argo_cd.kubernetes_namespace.bot will be created
  + resource "kubernetes_namespace" "bot" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "bot"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argo_cd.kubernetes_secret.bot_secrets will be created
  + resource "kubernetes_secret" "bot_secrets" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "bot-config-secret"
          + namespace        = "bot"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argo_cd.kubernetes_service.argocd will be created
  + resource "kubernetes_service" "argocd" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + session_affinity            = "None"
          + type                        = "NodePort"

          + port {
              + node_port   = (known after apply)
              + port        = 8080
              + protocol    = "TCP"
              + target_port = "8080"
            }
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Eliaxie, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*